In [6]:
import pandas as pd

In [7]:
df=pd.read_csv("C:/Users/vardh/Desktop/Pubg.csv")

In [8]:
df.head()

            Name   Tier     KD  Server  Rating
0    killerchand  105.0   1.60     1.0    80.9
1   killerchand   101.0   1.20     5.0    69.8
2  karthikwizard  501.0   0.70     1.0    65.0
3  karthikwizard  305.0  12.00     NaN    75.0
4     solowizard  101.0   0.96     1.0    56.0

In [9]:
df.head(10)

            Name    Tier     KD  Server  Rating
0    killerchand   105.0   1.60     1.0   80.90
1   killerchand    101.0   1.20     5.0   69.80
2  karthikwizard   501.0   0.70     1.0   65.00
3  karthikwizard   305.0  12.00     NaN   75.00
4     solowizard   101.0   0.96     1.0   56.00
5     solowizard   301.0  10.00     4.0   67.00
6    Ravikishore   500.0   3.90     1.0   76.98
7    Ravikishore     NaN  20.00     NaN   22.00
8       potty143   500.0  24.00     NaN   38.00
9       potty143  4500.0   0.78     1.0   87.00

In [10]:
df.describe()

              Tier         KD    Server     Rating
count     9.000000  10.000000  7.000000  10.000000
mean    768.222222   7.514000  2.000000  63.768000
std    1409.989608   8.670692  1.732051  20.141698
min     101.000000   0.700000  1.000000  22.000000
25%     105.000000   1.020000  1.000000  58.250000
50%     305.000000   2.750000  1.000000  68.400000
75%     500.000000  11.500000  2.500000  76.485000
max    4500.000000  24.000000  5.000000  87.000000

In [11]:
#there are some nan values in the data
#to fill that data we use fill method

In [12]:
df1=df.fillna(method='ffill')

In [13]:
#set feature

In [14]:
features=['Tier','Server']

In [15]:
X=df1[features]

In [16]:
y=df.Rating

In [17]:
X.describe()

              Tier     Server
count    10.000000  10.000000
mean    741.400000   1.700000
std    1332.054153   1.494434
min     101.000000   1.000000
25%     154.000000   1.000000
50%     402.500000   1.000000
75%     500.000000   1.000000
max    4500.000000   5.000000

In [18]:
from sklearn.tree import DecisionTreeRegressor
file=DecisionTreeRegressor(random_state=1)

In [19]:
file.fit(X,y)

DecisionTreeRegressor(criterion='mse', max_depth=None, max_features=None,
                      max_leaf_nodes=None, min_impurity_decrease=0.0,
                      min_impurity_split=None, min_samples_leaf=1,
                      min_samples_split=2, min_weight_fraction_leaf=0.0,
                      presort=False, random_state=1, splitter='best')

In [20]:
prediction=file.predict(X)

In [21]:
print(prediction)

[80.9  69.8  65.   75.   56.   67.   45.66 45.66 45.66 87.  ]